package com.example.rere.practice.testdistinct;

import com.example.rere.practice.base.activity.TestBaseActivity;

import android.content.Context;
import android.content.Intent;
import android.view.View;
import android.widget.LinearLayout;

import java.util.ArrayList;
import java.util.LinkedHashSet;
import java.util.List;

/**
 * Created by rere on 17-12-31.
 */

public class TestDistinctAct extends TestBaseActivity {

    public static void start(Context context) {
        context.startActivity(new Intent(context, TestDistinctAct.class));
    }

    private List<String> list1;//平台客户号列表

    private List<String> list2;//通讯录

    private List<String> getList1() {
        ArrayList<String> strings = new ArrayList<>();
        strings.add("1");
        strings.add("2");
        strings.add("3");
        strings.add("4");
        return strings;
    }

    private List<String> getList2() {
        ArrayList<String> strings = new ArrayList<>();
        strings.add("0");
        strings.add("2");
        strings.add("3");
        strings.add("5");
        return strings;
    }

    @Override
    protected void addViews(LinearLayout layout) {
        getButton(layout, "get distinct", new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                // get distinct
                handle();
            }
        });
    }

    private void handle() {
        /*list1 = getList1();
        list2 = getList2();*/

        list1 = ConvertString2ListUtils.convert("杨杰,张应丰,陈忠,温忠源,肖群,邓玉,胡向军,胡凡,黄盛,刘雨婷,谢艳文,胡璇,何铠锋,杨妙,吕乐,邓锦栩,程浩,简志枰,谢晖,方智,黎民,段练,赵娜,黄宇鹏,张海峰,郑玮,吴云侠,陈杰华,董学敏,刘继忠,黄静宾,林洋,肖敏,何睿,杨雷,何欢,蒋吉荣,吴英岗,杨靖,叶万军,张胤,蔡瑞强,代彪,黄丽婷,林伟泳,全劲敏,吴秦明,肖拥斌,许启胜,严文波,谢志宏,杨成海,杨光,晏文娟,陈宇恒,胡新芳,杨达,张鹏辉,杨志浩,邓建平,黄俏丹,戴定东,刘秀芹,黄清颖,陈博,莫晓昕,刘德波,彭远浩,刘婉真,梁源,张颖,杨家俊,陈大平,程明远,邓胜辉,蓝洪波,刘家诚,袁媛,江魁栋,汪如海,徐光超,苏贤杰,王康椿,陈楚杰,杨虎,莫杰,张囡,陈剑锐,范玄,罗蕾,彭李超,肖伟,陈勇,李明琦,曹广平,刘永乾,孔志坚,李作兵,邓国宇,胡江,刘枝远,王振生,樊广源,兰翔,李晶,肖琳,庄序达,范雄健,李泽龙,陈涛,欧明辉,叶苏诺,黄瑾,周小聪,杨创业,喻擎,梁继平,杨莉 ,丘志臻,陈志聃,黎洪达,卿洋铭,吴伯宁,严伟洪,姚俊鹏,涂彦,冯梓健,李长斌,曾泽香,黄冲,谭雅,萧韵婷,谢文浩,刘琼,田棚茂,黎卓锋,张亚莉,张毅锋,钟博,唐吟,刘琪,唐春娇,王佳文,干芸芸,马加宁,英杰,王进,陈剑,彭晨漪,麦博奇,唐燕,邹骏杰,关宇坤,徐文龙,袁子路,朱启敏,陈建量,李祥,胡观兵,李冲,陈锋,杨若衡,张春华,潘运军,邓亚芳,林浪桥,彭勇,李震,王炬华,胡仲强,林瑞淇,张敏,李伟健,李志刚,黄壮杰,劳醒苟,李曦,林锦群,林挺,李建华,肖燕芳,李焕达,林友明,陈银,黄凡玮,李崇辉,聂义斌,何嘉荣,朱峰华,陈幼凌,梁建锋,吴碧华,邓小茜,戴澧郴,张靖,郑志峰,邓海东,唐敏,黄丹,梁恺欣,林志英,黄文静,刘永华,杜志华,崔文宇,李康稳,姜丽丽,张妙仪,郑素平,程慧亭,杨子炫,许立山,陆健腾,彭嘉琦,蔡跃进,袁亮,张琼梅,黎志勇,梁斯琪,涂祥华,黎倩莹,王伟樟,叶凌风,陈文彦,江郁滨,符军,曾少铭,赵瑶卿,吴缅滇,杨爽,张璇,关秉智,陈晓君,周立雄,张晴,王艳,曾芷媚,张帆,朱琦轩,詹雅棋,程洁,陈思齐,张建辉,袁宇晖,蒋祁效,徐兰,兰欣,钟小靖,毛建忠,彭频,黄俊琼,田菁,陈洁,卢忻,陈历智,黄耿明,曾德,黄东生,赖婉英,熊会会,徐孝磊,颜蜜,何菁仪,张翌阳,杨立兴,黄日升,方颖,柳扬歌,郑少贤,陈泽垒,杨扬,陈林,傅强,邓梁,张舜华,张舜华,何洁珍,何明杰,李尚真,王伟,庞以新,张兴强,包辰明,陶然,王海潮,王寻,何燕萍,张明,彭塨烨,何小锋,庄海元,胡立强,廖继逢,丘群业,章梦,赵金鑫,郭友德,骆国生,庞云鹏,马林,朱伙,邓龙腾,侯伟远,胡建波,胡宗维,李观钊,李响,李永春,梁可尊,刘威,刘颖莲,卢颖辉,任文涛,汪楠,王明龙,谢潇宇,吴兴,王力,陈暑生,赵欣,谢豪运,李思,林茜,黄立峰,黎思韵,梁思敏,吴风雷,邹伟力,王晓鹏,胡平,史文,李红霞,崔海波,张利珍,倪洁琼,罗烨敏,刘姝,邱韬奋,吴志浩,黄海明,陈浩然,林锋,罗灿年,谢沙,熊敏,杨春喜,杜智铨,李兴华,陆江平,林寿宏,莫婷婷,曾毅锋,陈柏年,陈欣,何嘉杰,王学益,吴双,张志辉,陈晓燕,廖敏飞,范会善,覃鹏,李文鹏,陆祺,刘丽娟,吴孟晴,董思,禤栋雄,梁伟韬,梁永健,王朔,许腾,李威,龚苇,解敏,何伟明,谭世殊,任国力,王泽龙,梁学甲,黄瑞吟,唐泽龙,吴仰波,梁志坚,陈泽智,周思彤,郭敏鸿,刘志坚,罗恕人,何彦辉,王炼,王雨,薛红星,成亮,吴宾,揭育柱,付小丽,侯戬,刘宁锋,石瑜育,余学武,罗贤桂,赵新阳,马亮亮,杨蔚然,翁伟东,李丹,胡玮,吴兴威,徐小琳,姚芳,潘秋真,董劲麟,廖宫燕,李泳驱,韦彪茂,季宜锋,郑凯婷,贺文明,梁艳姬,吕绍洲,张上仪,曾抗,曾相宗,黄俊,莫华玺,邱文超,詹韶鑫,赵华,陈志达,黄振光,吴广豪,万兵,陈铭洙,杜亮,沈东凯,张芸荧,炊向军,赖韬,胡俊,罗旋,王扬,尹智,李坚明,袁国能,韩敏仪,刘颖,", ",");
        list2 = ConvertString2ListUtils.convert("张应丰,杨杰,陈忠,曾少铭,赵瑶卿,吴缅滇,杨爽,张璇,关秉智,周立雄,张晴,曾芷媚,朱琦轩,程洁,邓小茜,陈思齐,张建辉,袁宇晖,戴澧郴,蒋祁效,徐兰,兰欣,钟小靖,毛建忠,彭频,钟博,黄俊琼,陈洁,邓海东,卢忻,黄耿明,陈历智,郑志峰,黄文静,杨立兴,何菁仪,黄日升,曾德,张靖,黄东生,梁恺欣,唐敏,赖婉英,徐孝磊,熊会会,黄丹,林志英,柳扬歌,唐吟,方颖,马加宁,陈泽垒,刘琪,郑少贤,干芸芸,唐春娇,王佳文,程慧亭,陈晓君,邓胜辉,程浩,陈大平,王进,蔡跃进,邹伟力,廖敏飞,傅强,李震,彭勇,郑玮,吴孟晴,石瑜育,杨蔚然,温忠源,杜志华,崔文宇,李康稳,姜丽丽,田菁,刘永华,郑素平,杨子炫,许立山,陆健腾,彭嘉琦,张帆,詹雅棋,邓玉,程浩,简志枰,谢晖,方智,黎民,黄盛,胡璇,段练,赵娜,胡向军,黄宇鹏,张海峰,郑玮,吴云侠,杨妙,陈杰华,董学敏,刘继忠,何睿,肖敏,吕乐,林洋,杨雷,黄静宾,蒋吉荣,吴英岗,何欢,叶万军,杨靖,张胤,吴秦明,许启胜,黄丽婷,全劲敏,代彪,蔡瑞强,肖拥斌,林伟泳,张鹏辉,杨达,陈宇恒,胡新芳,邓锦栩,谢志宏,杨成海,何铠锋,晏文娟,戴定东,黄清颖,杨志浩,邓建平,刘德波,刘秀芹,谢艳文,黄俏丹,莫晓昕,陈博,杨光,彭远浩,刘雨婷,刘婉真,梁源,张颖,杨家俊,肖群,王进,李震,彭勇,英杰,王炬华,胡仲强,陈锋,麦博奇,李冲,张敏,李志刚,黄壮杰,劳醒苟,肖燕芳,林锦群,李曦,黄凡玮,聂义斌,陈建量,李崇辉,徐文龙,潘运军,陈银,朱峰华,林友明,张毅锋,李祥,林浪桥,陈剑,胡观兵,袁子路,朱启敏,黎卓锋,唐燕,刘琼,蔡建强,邹骏杰,关宇坤,李焕达,陈幼凌,梁建锋,田棚茂,彭晨漪,张亚莉,吴碧华,郭敏鸿,蔡跃进,廖敏飞,何彦辉,王炼,范会善,王雨,薛红星,吴宾,廖宫燕,刘丽娟,刘宁锋,侯戬,吴孟晴,石瑜育,董思,梁伟韬,罗贤桂,翁伟东,赵新阳,马亮亮,余学武,董劲麟,姚芳,徐小琳,胡玮,潘秋真,许腾,黄振光,曾抗,黄俊,詹韶鑫,赵华,吕绍洲,郑凯婷,贺文明,张上仪,李泳驱,何伟明,解敏,谭世殊,杜亮,炊向军,罗旋,沈东凯,黄瑞吟,万兵,吴广豪,王扬,赖韬,胡俊,韦彪茂,张芸荧,陈泽智,梁志坚,李坚明,周思彤,袁国能,韩敏仪,刘颖,吴风雷,傅强,邓梁,何洁珍,张舜华,何明杰,李尚真,王伟,庞以新,张兴强,何燕萍,王寻,包辰明,王海潮,何小锋,彭塨烨,张明,庄海元,章梦,胡立强,丘群业,廖继逢,李永春,汪楠,胡建波,胡宗维,梁可尊,刘威,王明龙,李响,刘颖莲,邓龙腾,侯伟远,骆国生,庞云鹏,朱伙,马林,林茜,谢豪运,吴兴,赵欣,王力,郭友德,卢颖辉,任文涛,李思,黄立峰,梁思敏,黎思韵,温忠源,陈大平,程明远,邓胜辉,蓝洪波,覃鹏,袁媛,刘家诚,徐光超,汪如海,苏贤杰,陈楚杰,王康椿,杨虎,陆祺,张囡,梁永健,莫杰,彭李超,陈剑锐,范玄,肖伟,罗蕾,陈勇,王振生,李明琦,曹广平,李作兵,刘枝远,孔志坚,胡江,禤栋雄,刘永乾,邓国宇,肖琳,兰翔,庄序达,李晶,樊广源,卿洋铭,黎洪达,黄瑾,吴伯宁,姚俊鹏,周小聪,陈志聃,严伟洪,欧明辉,梁继平,龚苇,陈涛,丘志臻,李泽龙,范雄健,喻擎,曾泽香,涂彦,王泽龙,李长斌,梁学甲,黄冲,任国力,唐泽龙,杨莉,吴仰波,王朔,李威,叶苏诺,谭雅,杨创业,萧韵婷,谢文浩,陈林,邹伟力,罗恕人,王晓鹏,胡平,李红霞,张利珍,崔海波,倪洁琼,李丹,罗烨敏,揭育柱,莫婷婷,林寿宏,付小丽,邱韬奋,刘姝,杨蔚然,陈浩然,杨春喜,黄海明,罗灿年,谢沙,熊敏,吴兴威,李兴华,杜智铨,陆江平,莫华玺,邱文超,曾相宗,李观钊,何嘉杰,谢潇宇,陈欣,曹科,梁艳姬,陈柏年,曾毅锋,陈铭洙,吴双,王学益,尹智,张志辉,陈晓燕,曾少铭,袁亮,张琼梅,黎志勇,梁斯琪,涂祥华,黎倩莹,叶凌风,陈文彦,江郁滨,符军,邝耀明,杨家俊,陈银,刘家诚,徐小琳,罗烨敏,黎思韵,黄瑞吟,", ",");

        List<String> duplicateValus = new ArrayList<>();
        List<String> uniqueValues = new ArrayList<>();

/*
        // 找出list2在list1中的部分。
        for (String s : list2) {
            if (list1.contains(s)) {
                duplicateValus.add(s);
            } else {
                uniqueValues.add(s);
            }
        }

        TagLog.i(TAG, "handle() : " + " list1 = " + list1 + ",");
        TagLog.i(TAG, "handle() : " + " list2 = " + list2 + ",");
        TagLog.i(TAG, "handle() : " + " duplicateValus = " + duplicateValus + ",");
        TagLog.i(TAG, "handle() : " + " uniqueValues = " + uniqueValues + ",");
*/


        LinkedHashSet<String> duplicatesResult = new LinkedHashSet<>();
        LinkedHashSet<String> uniquesResult = new LinkedHashSet<>();
        ConvertString2ListUtils.getDuplicateAndUniqueBetweenTwoList(list1, list2, duplicatesResult, uniquesResult);

        int debugLine = 0;
    }


}
